lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
  const bool ok = g_radio.begin(g_channel, 8);
  Serial.print("\r\nZigbeeHaDimmableLightJoinable start\r\n");
  Serial.print("radio=");
  Serial.print(ok ? "OK" : "FAIL");
  Serial.print(" pwm=");
  Serial.print(g_pwmReady ? "OK" : "FAIL");
  Serial.print(" preferred_channel=");
  Serial.print(kPreferredChannel);
  Serial.print(" joined=");
  Serial.print(g_joined ? "yes" : "no");
  Serial.print("\r\n");
  Serial.print("serial commands: t=toggle U=brighter D=dimmer M=mid r=report s=status j=rejoin c=clear\r\n");

  if (g_joined) {
    g_radio.setChannel(g_channel);
  }
}

void loop() {
  handleSerialCommands();

  const uint32_t now = millis();
  const ZigbeeCommissioningAction action =
      ZigbeeCommissioning::nextAction(&g_network, now);
  if (!g_joined) {
    clearPendingApsAck();
    clearRecentInboundAps();
    if (action == ZigbeeCommissioningAction::kPollParent &&
        (now - g_lastPollMs) >= 250U) {
      g_lastPollMs = now;
      pollCoordinator();
    } else if (action == ZigbeeCommissioningAction::kSecureRejoin) {
      Serial.print("secure_rejoin start\r\n");
      if (performSecureRejoin()) {
        Serial.print("secure_rejoin OK ch=");
      } else {
        Serial.print("secure_rejoin MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
    } else if (action == ZigbeeCommissioningAction::kJoin) {
      Serial.print("scan_join start\r\n");
      if (!performJoin()) {
        Serial.print("join MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print("join OK ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print("\r\n");
    }
    delay(1);
    return;
  }

  if (action == ZigbeeCommissioningAction::kRequestEndDeviceTimeout) {
    const bool ok = sendEndDeviceTimeoutRequest();
    Serial.print("end_device_timeout_req ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
  } else if (action == ZigbeeCommissioningAction::kSendDeviceAnnounce) {
    const bool ok = sendDeviceAnnounce();
    Serial.print("device_announce ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
  }

  if ((now - g_lastPollMs) >= g_parentPollIntervalMs) {
    g_lastPollMs = now;
    pollCoordinator();
  }
  maybeExpirePendingApsAck(now);
  maybeSendScheduledReports(now);
  applyLedState();

  if ((now - g_lastStatusMs) >= 5000U) {
    g_lastStatusMs = now;
    Serial.print("alive ch=");
    Serial.print(g_channel);
    Serial.print(" pan=0x");
    Serial.print(g_panId, HEX);
    Serial.print(" short=0x");
    Serial.print(g_localShort, HEX);
    Serial.print(" nwk_seq=");
    Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
    Serial.print(" poll_ms=");
    Serial.print(g_parentPollIntervalMs);
    Serial.print(" onoff=");
    Serial.print(g_device.onOff() ? "ON" : "OFF");
    Serial.print(" level=");
    Serial.print(g_device.level());
    Serial.print("\r\n");
  }

  delay(1);
}
